; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	thermograph5 - mode
	spectrograph0 - mode
	infrared1 - mode
	infrared6 - mode
	spectrograph4 - mode
	spectrograph3 - mode
	thermograph2 - mode
	spectrograph7 - mode
	Star1 - direction
	Star2 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation8 - direction
	GroundStation7 - direction
	Star6 - direction
	Star0 - direction
	GroundStation5 - direction
	Star9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 spectrograph7)
	(supports instrument0 spectrograph4)
	(supports instrument0 thermograph5)
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 Star0)
	(supports instrument1 thermograph2)
	(supports instrument1 thermograph5)
	(supports instrument1 infrared6)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 GroundStation7)
	(calibration_target instrument1 Star6)
	(supports instrument2 thermograph5)
	(supports instrument2 infrared1)
	(calibration_target instrument2 GroundStation5)
	(calibration_target instrument2 Star0)
	(calibration_target instrument2 Star6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
)
(:goal (and
	(have_image Star9 spectrograph4)
	(have_image Star9 spectrograph3)
	(have_image Phenomenon10 infrared1)
	(have_image Phenomenon11 spectrograph0)
	(have_image Phenomenon11 infrared1)
	(have_image Star12 spectrograph4)
	(have_image Star12 spectrograph0)
	(have_image Phenomenon13 infrared1)
))

)

; plan
1. (turn_to satellite0 groundstation7 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 groundstation7)
   goals met: 0 of 8
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 8
3. (calibrate satellite0 instrument1 groundstation7)
   added: (calibrated instrument1)
   goals met: 0 of 8
4. (turn_to satellite0 star12 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 star12)
   goals met: 0 of 8
5. (take_image satellite0 star12 instrument1 spectrograph0)
   added: (have_image star12 spectrograph0)
   goals met: 1 of 8
6. (turn_to satellite0 phenomenon11 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 phenomenon11)
   goals met: 1 of 8
7. (take_image satellite0 phenomenon11 instrument1 spectrograph0)
   added: (have_image phenomenon11 spectrograph0)
   goals met: 2 of 8
8. (turn_to satellite0 star0 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 star0)
   goals met: 2 of 8
9. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 2 of 8
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 8
11. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 2 of 8
12. (turn_to satellite0 star12 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star12)
   goals met: 2 of 8
13. (take_image satellite0 star12 instrument0 spectrograph4)
   added: (have_image star12 spectrograph4)
   goals met: 3 of 8
14. (turn_to satellite0 star9 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star9)
   goals met: 3 of 8
15. (take_image satellite0 star9 instrument0 spectrograph3)
   added: (have_image star9 spectrograph3)
   goals met: 4 of 8
16. (take_image satellite0 star9 instrument0 spectrograph4)
   added: (have_image star9 spectrograph4)
   goals met: 5 of 8
17. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 5 of 8
18. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 5 of 8
19. (turn_to satellite0 groundstation5 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation5)
   goals met: 5 of 8
20. (calibrate satellite0 instrument2 groundstation5)
   added: (calibrated instrument2)
   goals met: 5 of 8
21. (turn_to satellite0 phenomenon10 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 phenomenon10)
   goals met: 5 of 8
22. (take_image satellite0 phenomenon10 instrument2 infrared1)
   added: (have_image phenomenon10 infrared1)
   goals met: 6 of 8
23. (turn_to satellite0 phenomenon11 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon11)
   goals met: 6 of 8
24. (take_image satellite0 phenomenon11 instrument2 infrared1)
   added: (have_image phenomenon11 infrared1)
   goals met: 7 of 8
25. (turn_to satellite0 phenomenon13 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon13)
   goals met: 7 of 8
26. (take_image satellite0 phenomenon13 instrument2 infrared1)
   added: (have_image phenomenon13 infrared1)
   goals met: 8 of 8
